app/controllers/accounts_controller.rb

SELECT `accounts`.* FROM `accounts`
SELECT `operations`.* FROM `operations` WHERE `operations`.`account_id` = 1
---
	def index
		if Account.all
			render json: Account.all, :except => [:updated_at], :include => [:operations => {:except =>[:updated_at]}]

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
SELECT `operations`.* FROM `operations` WHERE `operations`.`account_id` = 2
---
	def show
		if Account.exists?(params[:id])
			render json: Account.find(params[:id]), :except => [:updated_at], :include => [:operations => {:except =>[:updated_at]}]

INSERT INTO `accounts` (`a_type`, `number`, `amount`, `balance`, `created_at`, `updated_at`) VALUES ('Corriente', '1234-1234-12-1234567890', 0.0, 0.0, '2015-05-19 02:35:14', '2015-05-19 02:35:14')
---
	def create
		cuenta = Account.new(permit)
		if cuenta.valid?
			cuenta.save

DELETE FROM `accounts` WHERE `accounts`.`id` = 1
---
	def destroy
		if Account.exists?(params[:id])
			Account.delete(params[:id])

UPDATE `accounts` SET `balance` = 0.0, `updated_at` = '2015-05-19 02:37:32' WHERE `accounts`.`id` = 1
---
	def update
		if Account.exists?(params[:id])
			Account.update(params[:id], permit)