app/controllers/customers_controller.rb

	def index
		if Customer.all
			render json: Customer.all, :except => [:updated_at], :include => [:accounts => {:except =>[:created_at, :updated_at, :customer_id]}]
---
SELECT `customers`.* FROM `customers`
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`customer_id` = 1

	def show
		if Customer.exists?(params[:id])
			render json: Customer.find(params[:id]), :except => [:updated_at], :include => [:accounts => {:except =>[:created_at, :updated_at, :customer_id]}]
---
SELECT  `customers`.* FROM `customers` WHERE `customers`.`id` = 1 LIMIT 1

	def create
		cliente = Customer.new(permit)
		if cliente.valid?
			cliente.save
---
INSERT INTO `customers` (`name`, `last_name`, `id_number`, `address`, `phone`, `mail`, `created_at`, `updated_at`) VALUES ('Alexander', 'Ballera', '08983523', 'av orinoco', '123267340', 'alex@alx.com', '2015-05-19 03:37:48', '2015-05-19 03:37:48')

	def destroy
		if Customer.exists?(params[:id])
			Customer.delete(params[:id])
---
DELETE FROM `customers` WHERE `customers`.`id` = 2

	def update
		if Customer.exists?(params[:id])
			Customer.update(params[:id], permit)
---
UPDATE `customers` SET `name` = 'Juan', `last_name` = 'Bolivar', `updated_at` = '2015-05-19 12:06:09' WHERE `customers`.`id` = 1