app/controllers/operations_controller.rb

SELECT `operations`.* FROM `operations` WHERE (date>='2015-05-01' and date <='2015-05-31')
---
	def index
		if Operation.all

SELECT  `operations`.* FROM `operations` WHERE `operations`.`id` = 1 LIMIT 1
---
	def show
		if Operation.exists?(params[:id])
			render json: Operation.find(params[:id]), :except => [:updated_at, :account_id, :account_id2, :customer_id]

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
INSERT INTO `operations` (`o_type`, `pay_type`, `date`, `a_origin`, `amount`, `account_id`, `customer_id`, `created_at`, `updated_at`) VALUES ('Deposito', 'Efectivo', '2015-05-30', '0123-0123-12-1234567890', 50000.0, 1, 1, '2015-05-31 19:30:12', '2015-05-31 19:30:12')
---
	def deposit
		deposit = Operation.new(params_deposit)
		account = Account.find(params_deposit[:account_id])

		if Operation.deposits(params_deposit[:o_type],
			params_deposit[:a_origin],
			params_deposit[:amount],
			account)
			deposit.save

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
INSERT INTO `operations` (`o_type`, `pay_type`, `date`, `a_origin`, `amount`, `account_id`, `customer_id`, `created_at`, `updated_at`) VALUES ('Retiro', 'Efectivo', '2015-05-30', '0123-0123-12-1234567890', 5000.0, 1, 1, '2015-05-31 01:18:11', '2015-05-31 01:18:11')
---
	def withdrawal
		withdrawal = Operation.new(params_withdrawal)
		account = Account.find(params_withdrawal[:account_id])

		if Operation.withdrawals(params_withdrawal[:o_type],
			params_withdrawal[:a_origin],
			params_withdrawal[:amount],
			account)
			withdrawal.save

SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 1 LIMIT 1
INSERT INTO `operations` (`o_type`, `pay_type`, `date`, `a_origin`, `a_target`, `amount`, `account_id`, `account_id2`, `customer_id`, `created_at`, `updated_at`) VALUES ('Transferencia', 'Efectivo', '2015-05-30', '0123-0123-12-1234567890', '0123-0123-12-1234567891', 5500.0, 1, 2, 1, '2015-05-31 03:02:17', '2015-05-31 03:02:17')
---
	def transfer
		transfer = Operation.new(params_transfer)
		account = Account.find(params_transfer[:account_id])
		account2 = Account.find(params_transfer[:account_id2])

		if Operation.transfers(params_transfer[:o_type],
			params_transfer[:a_origin],
			params_transfer[:a_target],
			params_transfer[:amount],
			account, account2)
			transfer.save

DELETE FROM `operations` WHERE `operations`.`id` = 1
---
	def destroy
		if Operation.exists?(params[:id])
			Operation.delete(params[:id])

UPDATE `operations` SET `o_type` = 'Deposito', `updated_at` = '2015-05-19 02:14:36' WHERE `operations`.`id` = 3
---
	def update
		if Operation.exists?(params[:id])
			Operation.update(params[:id], permit)